project/src/Catalogs/ДополнительныеМодули.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДополнительныеМодули</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазделыДополнительныхМодулей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Enums/РазделыДополнительныхМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>РазделыДополнительныхМодулей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Базисный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Catalogs/ДополнительныеМодули/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает наименование модуля по умолчанию, в зависимости от Раздела.
// Параметры:
//   Раздел - Перечисление.РазделыДополнительныхМодулей - Для какого раздела следует получить наименование.
Функция НаименованиеПоУмолчанию(Раздел) Экспорт
	Если Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
		Возврат "МенеджерОбменаАлгоритмы";
	ИначеЕсли Раздел =  Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка Тогда 
		Возврат "МенеджерОбменаДокументыОтправка";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
		Возврат "МенеджерОбменаДокументыПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка Тогда
		Возврат "МенеджерОбменаПрочееОтправка"; 
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение Тогда
		Возврат "МенеджерОбменаПрочееПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
		Возврат "МенеджерОбменаПрочееПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
		Возврат "МенеджерОбменаЧерезУниверсальныйФормат";
	КонецЕсли;
	
    Возврат "МенеджерОбменаДополнительныйМодуль";
КонецФункции 
#КонецОбласти
#КонецЕсли
